Reports/б_ОтчетПоБюджетуБООбъемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Report>
		<Properties>
			<Name>б_ОтчетПоБюджетуБООбъемы</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаПериода</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеСпискаОрганизаций</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеСпискаПодразделений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасширеннаяНастройка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтрицательноеКрасным</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеОтчета</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормируемыйБюджет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.фин_Бюджеты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядкиОкругленияОтчетности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

AccumulationRegisters/б_Бюджет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>б_Бюджет</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяБюджета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.фин_СтатьиБюджета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Бюджет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.фин_Бюджеты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДополнительнаяАналитика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
						<v8:Type>cfg:CatalogRef.фин_СтатьиБюджета</v8:Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
						<v8:Type>cfg:CatalogRef.НематериальныеАктивы</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИсточникФинансирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.битИсточникиФинансирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/б_БюджетФакт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>б_БюджетФакт</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПризнакКоличество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПлан</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяБюджета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.фин_СтатьиБюджета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Бюджет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.фин_Бюджеты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИсточникФинансирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.битИсточникиФинансирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ПорядкиОкругленияОтчетности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ПорядкиОкругленияОтчетности</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Окр1</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Окр1000</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Окр1000000</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Reports/б_ОтчетПоБюджетуБООбъемы/Ext/ObjectModule.bsl
Перем мСписокИсточниковФинансирования Экспорт;
Перем мСписокСтруктурныхЕдиниц Экспорт;
Перем мСписокПодразделений Экспорт;
Перем мДеревоСтруктурныхЕдиниц Экспорт;
Перем СохраненнаяНастройка Экспорт;
Перем Расшифровки Экспорт;
Перем ПромежуточныеДанные Экспорт;
Перем РежимРасшифровки Экспорт;
Перем ВедётсяУчетПоПодразделениям Экспорт;

#Если Клиент Тогда

Процедура ЗаполнитьНачальныеНастройки() Экспорт
	
	СтандартныеОтчеты.ЗаполнитьДанныеОтчета(ЭтотОбъект);
	
КонецПроцедуры

Процедура СформироватьОтчет(Результат = Неопределено, ДанныеРасшифровки = Неопределено, ВыводВФормуОтчета = Истина, ВнешниеНаборыДанных = Неопределено) Экспорт
	
	//Результат.Очистить();
	
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	//ВыводЗаголовкаОтчета(ЭтотОбъект, Результат);
	ДоработатьКомпоновщикПередВыводом(ВнешниеНаборыДанных);
	СтандартныеОтчеты.ВывестиОтчет(ЭтотОбъект, Результат, ДанныеРасшифровки, ВыводВФормуОтчета, ВнешниеНаборыДанных);
	КомпоновщикНастроек.ЗагрузитьНастройки(Настройки);
	
	// Выполним дополнительную обработку Результата отчета
	ОбработкаРезультатаОтчета(Результат);
	
	УправлениеОтчетами.УстановитьКолонтитулыПоУмолчанию(Результат, ПолучитьТекстЗаголовка(), Строка(глТекущийПользователь));
	
	Возврат;
	
КонецПроцедуры

// В процедуре можно доработать компоновщик перед выводом в отчет
// Изменения сохранены не будут
Процедура ДоработатьКомпоновщикПередВыводом(ВнешниеНаборыДанных) Экспорт
	
	Если ЗначениеЗаполнено(НачалоПериода) Тогда
		ТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "НачалоПериода", НачалоДня(НачалоПериода));
	Иначе
		ТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "НачалоПериода", Дата(1, 1, 1));
	КонецЕсли;
	Если ЗначениеЗаполнено(КонецПериода) Тогда
		ТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "КонецПериода", КонецДня(КонецПериода));
	Иначе
		ТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "КонецПериода", Дата(3999, 11, 1));
	КонецЕсли;
	
	ВнешниеНаборыДанных = Новый Структура;
	ВыборкаДанных = ПолучитьВыборку();
	ВнешниеНаборыДанных.Вставить("ТаблицаДанных", ВыборкаДанных);
	
	Поле = СхемаКомпоновкиДанных.НаборыДанных[0].Поля.Найти("КоличествоИтого");
	Если Поле <> Неопределено Тогда
		Поле.Заголовок = "План "+Формат(Год(НачалоПериода), "ЧГ=0")+" года";
	КонецЕсли;
	
	Поле = СхемаКомпоновкиДанных.НаборыДанных[0].Поля.Найти("КоличествоПредыдущий");
	Если Поле <> Неопределено Тогда
		Если Год(НачалоДня(Дата(Год(НачалоПериода)-1,1,1))) = 2016 Тогда
			Поле.Заголовок = "Факт " + Формат(Год(НачалоДня(Дата(Год(НачалоПериода)-1,1,1))),"ЧГ=0")+" года";
		ИначеЕсли Год(НачалоДня(Дата(Год(НачалоПериода)-1,1,1))) = 2017 Тогда
			Поле.Заголовок = "Факт " + Формат(Год(НачалоДня(Дата(Год(НачалоПериода)-1,1,1))),"ЧГ=0")+" года";
	    ИначеЕсли Год(НачалоДня(Дата(Год(НачалоПериода)-1,1,1))) = 2018 Тогда
			Поле.Заголовок = "Факт " + Формат(Год(НачалоДня(Дата(Год(НачалоПериода)-1,1,1))),"ЧГ=0")+" года";

		Иначе
			Поле.Заголовок = "Факт " + Формат(Год(НачалоДня(Дата(Год(НачалоПериода)-1,1,1))),"ЧГ=0")+" года";
		КонецЕсли;
		
	КонецЕсли;

	Поле = СхемаКомпоновкиДанных.НаборыДанных[0].Поля.Найти("КоличествоПредществующий");
	Если Поле <> Неопределено Тогда
		Поле.Заголовок = "Факт "+Формат(Год( НачалоДня(Дата(Год(НачалоПериода)-2,1,1))), "ЧГ=0")+" года";
	КонецЕсли;
	
	Поле = СхемаКомпоновкиДанных.НаборыДанных[0].Поля.Найти("КоличествоТриГодаНазад");
	Если Поле <> Неопределено Тогда
		Поле.Заголовок = "Факт "+Формат(Год( НачалоДня(Дата(Год(НачалоПериода)-3,1,1))), "ЧГ=0")+" года";
	КонецЕсли;
	
	Поле = СхемаКомпоновкиДанных.НаборыДанных[0].Поля.Найти("КоличествоТриГодаНазад");
	Если Поле <> Неопределено Тогда
		Поле.Заголовок = "Факт "+Формат(Год( НачалоДня(Дата(Год(НачалоПериода)-3,1,1))), "ЧГ=0")+" года";
	КонецЕсли;
	
		
	Поле = СхемаКомпоновкиДанных.НаборыДанных[0].Поля.Найти("КоличествоПланПредыдущий");
		Если Поле <> Неопределено Тогда
			Поле.Заголовок = "План " + Формат(Год(НачалоДня(Дата(Год(НачалоПериода)-1,1,1))),"ЧГ=0")+" года";
			
			Если Год(НачалоДня(Дата(Год(НачалоПериода)-1,1,1))) = 2019 Тогда

				Поле.Заголовок = "План " + Формат(Год(НачалоДня(Дата(Год(НачалоПериода)-1,1,1))),"ЧГ=0") + " года (корректировка, оценка)";
				
			КонецЕсли;
			
		КонецЕсли;

	
	Поле = СхемаКомпоновкиДанных.ВычисляемыеПоля.Найти("ПроцентОтклонение1");
	Если Поле <> Неопределено Тогда
		Поле.Заголовок = "План "+Формат(Год(НачалоПериода), "ЧГ=0")+" года к факту "+Формат(Год( НачалоДня(Дата(Год(НачалоПериода)-1,1,1))), "ЧГ=0")+" года, %";
	КонецЕсли;

	Поле = СхемаКомпоновкиДанных.ВычисляемыеПоля.Найти("ПроцентОтклонение2");
	Если Поле <> Неопределено Тогда
		Поле.Заголовок = "План "+Формат(Год(НачалоПериода), "ЧГ=0")+" года к факту "+Формат(Год( НачалоДня(Дата(Год(НачалоПериода)-2,1,1))), "ЧГ=0")+" года, %";
	КонецЕсли;

	Поле = СхемаКомпоновкиДанных.ВычисляемыеПоля.Найти("ПроцентОтклонение3");
	Если Поле <> Неопределено Тогда
		Поле.Заголовок = "План "+Формат(Год(НачалоПериода), "ЧГ=0")+" года к факту "+Формат(Год( НачалоДня(Дата(Год(НачалоПериода)-3,1,1))), "ЧГ=0")+" года, %";
	КонецЕсли;


	
	//Поле = СхемаКомпоновкиДанных.ВычисляемыеПоля.Найти("ФактКФактуПредыдущий");
	//Если Поле <> Неопределено Тогда
	//	Поле.Заголовок = "План "+Формат(Год(НачалоПериода), "ЧГ=0")+" года к факту "+Формат(Год( НачалоДня(Дата(Год(НачалоПериода)-3,1,1))), "ЧГ=0")+" года, %";
	//КонецЕсли;

	
	//Предыдущий период
	
	ТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "НачалоПредыдущегоПериода", НачалоДня(Дата(Год(НачалоПериода)-1,1,1)));
	ТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "КонецПредыдущегоПериода", КонецДня(Дата(Год(НачалоПериода)-1,12,31)));

	ТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "НачалоПредществующегоПериода", НачалоДня(Дата(Год(НачалоПериода)-2,1,1)));
	ТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "КонецПредществующегоПериода", КонецДня(Дата(Год(НачалоПериода)-2,12,31)));

	ТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "НачалоТриГодаНазад", НачалоДня(Дата(Год(НачалоПериода)-3,1,1)));
	ТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "КонецТриГодаНазад", КонецДня(Дата(Год(НачалоПериода)-3,12,31)));
	
	Если мДеревоСтруктурныхЕдиниц.Колонки.Количество() = 0 Тогда 
		
		СписокСтруктурныхЕдиниц = Новый СписокЗначений;
		СписокСтруктурныхЕдиниц.ЗагрузитьЗначения(мСписокСтруктурныхЕдиниц.ВыгрузитьЗначения());
		
		Для Каждого СтрПодразделение Из мСписокПодразделений Цикл 
			СписокСтруктурныхЕдиниц.Добавить(СтрПодразделение.Значение);
		КонецЦикла;		
				
		мДеревоСтруктурныхЕдиниц = СтандартныеОтчеты.СформироватьДеревоСЕ(, СписокСтруктурныхЕдиниц);
		
	КонецЕсли;
	
	ТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "ФормируемыйБюджет", ФормируемыйБюджет);
	ТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "ЕдиницаИзмерения", ЕдиницаИзмерения);
	
	ТиповыеОтчеты.ДобавитьОтборПоОрганизациямИПодразделениям(КомпоновщикНастроек, мДеревоСтруктурныхЕдиниц);
	
КонецПроцедуры

Процедура ИнициализацияОтчета() Экспорт
	
	СтандартныеОтчеты.ИнициализацияОтчета(ЭтотОбъект);
	
КонецПроцедуры

Процедура ВыводПодписиОтчета(Результат)
	
	//Макет = ПолучитьОбщийМакет("ОбщиеОбластиСтандартногоОтчета");
	//ОбластьПодписи        = Макет.ПолучитьОбласть("ПодписиПроверил");
	//Результат.Вывести(ОбластьПодписи);
	
КонецПроцедуры

Процедура ВыводЗаголовкаОтчета(ОтчетОбъект, Результат)
	
	СтандартныеОтчеты.ВыводЗаголовкаСпециализированногоОтчета(ОтчетОбъект, Результат);
			
КонецПроцедуры

Функция ПолучитьТекстЗаголовка(ОрганизацияВНачале = Истина) Экспорт 
		
	ЗаголовокОтчета = СокрЛП(ФормируемыйБюджет.Наименование) + СтандартныеОтчеты.ПолучитьПредставлениеПериода(ЭтотОбъект);

	Возврат ?(ОрганизацияВНачале, ЗаголовокОтчета, ЗаголовокОтчета + " " + СтандартныеОтчеты.ПолучитьТекстОрганизация(ЭтотОбъект));
		
КонецФункции

Функция ПолучитьВыборку ()
	
	Запрос = Новый Запрос;
         
	Запрос.Текст =
	"ВЫБРАТЬ
	|	БюджетОбороты.Организация КАК Организация,
	|	БюджетОбороты.СтатьяБюджета КАК СтатьяБюджета,
	|	БюджетОбороты.Статус,
	|	БюджетОбороты.Регистратор КАК ДокументДвижения,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(БюджетОбороты.Период) = 1
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(БюджетОбороты.КоличествоОборот, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(БюджетОбороты.КоличествоОборот, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(БюджетОбороты.КоличествоОборот, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоЯнварь,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(БюджетОбороты.Период) = 2
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(БюджетОбороты.КоличествоОборот, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(БюджетОбороты.КоличествоОборот, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(БюджетОбороты.КоличествоОборот, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоФевраль,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(БюджетОбороты.Период) = 3
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(БюджетОбороты.КоличествоОборот, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(БюджетОбороты.КоличествоОборот, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(БюджетОбороты.КоличествоОборот, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоМарт,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(БюджетОбороты.Период) = 4
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(БюджетОбороты.КоличествоОборот, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(БюджетОбороты.КоличествоОборот, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(БюджетОбороты.КоличествоОборот, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоАпрель,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(БюджетОбороты.Период) = 5
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(БюджетОбороты.КоличествоОборот, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(БюджетОбороты.КоличествоОборот, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(БюджетОбороты.КоличествоОборот, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоМай,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(БюджетОбороты.Период) = 6
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(БюджетОбороты.КоличествоОборот, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(БюджетОбороты.КоличествоОборот, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(БюджетОбороты.КоличествоОборот, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоИюнь,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(БюджетОбороты.Период) = 7
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(БюджетОбороты.КоличествоОборот, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(БюджетОбороты.КоличествоОборот, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(БюджетОбороты.КоличествоОборот, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоИюль,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(БюджетОбороты.Период) = 8
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(БюджетОбороты.КоличествоОборот, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(БюджетОбороты.КоличествоОборот, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(БюджетОбороты.КоличествоОборот, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоАвгуст,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(БюджетОбороты.Период) = 9
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(БюджетОбороты.КоличествоОборот, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(БюджетОбороты.КоличествоОборот, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(БюджетОбороты.КоличествоОборот, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоСентябрь,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(БюджетОбороты.Период) = 10
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(БюджетОбороты.КоличествоОборот, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(БюджетОбороты.КоличествоОборот, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(БюджетОбороты.КоличествоОборот, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоОктябрь,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(БюджетОбороты.Период) = 11
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(БюджетОбороты.КоличествоОборот, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(БюджетОбороты.КоличествоОборот, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(БюджетОбороты.КоличествоОборот, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоНоябрь,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(БюджетОбороты.Период) = 12
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(БюджетОбороты.КоличествоОборот, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(БюджетОбороты.КоличествоОборот, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(БюджетОбороты.КоличествоОборот, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоДекабрь,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(БюджетОбороты.Период) < 4
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(БюджетОбороты.КоличествоОборот, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(БюджетОбороты.КоличествоОборот, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(БюджетОбороты.КоличествоОборот, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоПервыйКвартал,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(БюджетОбороты.Период) > 3
	|				И МЕСЯЦ(БюджетОбороты.Период) < 7
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(БюджетОбороты.КоличествоОборот, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(БюджетОбороты.КоличествоОборот, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(БюджетОбороты.КоличествоОборот, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоВторойКвартал,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(БюджетОбороты.Период) > 6
	|				И МЕСЯЦ(БюджетОбороты.Период) < 10
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(БюджетОбороты.КоличествоОборот, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(БюджетОбороты.КоличествоОборот, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(БюджетОбороты.КоличествоОборот, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоТретийКвартал,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(БюджетОбороты.Период) > 9
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(БюджетОбороты.КоличествоОборот, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(БюджетОбороты.КоличествоОборот, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(БюджетОбороты.КоличествоОборот, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоЧетвертыйКвартал,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(БюджетОбороты.Период) < 7
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(БюджетОбороты.КоличествоОборот, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(БюджетОбороты.КоличествоОборот, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(БюджетОбороты.КоличествоОборот, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоЗаПолугодие,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(БюджетОбороты.Период) < 10
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(БюджетОбороты.КоличествоОборот, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(БюджетОбороты.КоличествоОборот, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(БюджетОбороты.КоличествоОборот, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоЗаДевятьМесяцев,
	|	ВЫБОР
	|		КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|			ТОГДА ЕСТЬNULL(БюджетОбороты.КоличествоОборот, 0) / 1000000
	|		ИНАЧЕ ВЫБОР
	|				КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|					ТОГДА ЕСТЬNULL(БюджетОбороты.КоличествоОборот, 0) / 1000
	|				ИНАЧЕ ЕСТЬNULL(БюджетОбороты.КоличествоОборот, 0)
	|			КОНЕЦ
	|	КОНЕЦ КАК КоличествоИтого,
	|	0 КАК КоличествоИтогоФакт,
	|	0 КАК КоличествоПредыдущий,
	|	0 КАК КоличествоПредществующий,
	|	0 КАК КоличествоТриГодаНазад,
	|	0 КАК ПризнакКоличество,
	|	0 КАК КоличествоПланПредыдущий
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	РегистрНакопления.б_Бюджет.Обороты(&Началопериода, &КонецПериода, Регистратор, Бюджет = &ФормируемыйБюджет) КАК БюджетОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	БюджетОборотыФакт.Организация,
	|	БюджетОборотыФакт.СтатьяБюджета,
	|	БюджетОборотыФакт.Статус,
	|	БюджетОборотыФакт.Регистратор,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ВЫБОР
	|		КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|			ТОГДА ЕСТЬNULL(БюджетОборотыФакт.КоличествоОборот, 0) / 1000000
	|		ИНАЧЕ ВЫБОР
	|				КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|					ТОГДА ЕСТЬNULL(БюджетОборотыФакт.КоличествоОборот, 0) / 1000
	|				ИНАЧЕ ЕСТЬNULL(БюджетОборотыФакт.КоличествоОборот, 0)
	|			КОНЕЦ
	|	КОНЕЦ,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.б_БюджетФакт.Обороты(&Началопериода, &КонецПериода, Регистратор, Бюджет = &ФормируемыйБюджет) КАК БюджетОборотыФакт
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	БюджетФактОбороты.Организация,
	|	БюджетФактОбороты.СтатьяБюджета,
	|	БюджетФактОбороты.Статус,
	|	БюджетФактОбороты.Регистратор,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ВЫБОР
	|		КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|			ТОГДА ЕСТЬNULL(БюджетФактОбороты.КоличествоОборот, 0) / 1000000
	|		ИНАЧЕ ВЫБОР
	|				КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|					ТОГДА ЕСТЬNULL(БюджетФактОбороты.КоличествоОборот, 0) / 1000
	|				ИНАЧЕ ЕСТЬNULL(БюджетФактОбороты.КоличествоОборот, 0)
	|			КОНЕЦ
	|	КОНЕЦ,
	|	0,
	|	0,
	|	БюджетФактОбороты.ПризнакКоличествоОборот,
	|	0
	|ИЗ
	|	РегистрНакопления.б_БюджетФакт.Обороты(&НачалоПредыдущегопериода, &КонецПредыдущегоПериода, Регистратор, Бюджет = &ФормируемыйБюджет) КАК БюджетФактОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	БюджетФактОбороты_Доп.Организация,
	|	БюджетФактОбороты_Доп.СтатьяБюджета,
	|	БюджетФактОбороты_Доп.Статус,
	|	БюджетФактОбороты_Доп.Регистратор,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ВЫБОР
	|		КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|			ТОГДА ЕСТЬNULL(БюджетФактОбороты_Доп.КоличествоОборот, 0) / 1000000
	|		ИНАЧЕ ВЫБОР
	|				КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|					ТОГДА ЕСТЬNULL(БюджетФактОбороты_Доп.КоличествоОборот, 0) / 1000
	|				ИНАЧЕ ЕСТЬNULL(БюджетФактОбороты_Доп.КоличествоОборот, 0)
	|			КОНЕЦ
	|	КОНЕЦ,
	|	0,
	|	БюджетФактОбороты_Доп.ПризнакКоличествоОборот,
	|	0
	|ИЗ
	|	РегистрНакопления.б_БюджетФакт.Обороты(&НачалоПредществующегоПериода, &КонецПредществующегоПериода, Регистратор, Бюджет = &ФормируемыйБюджет) КАК БюджетФактОбороты_Доп
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	БюджетФактОбороты_Доп.Организация,
	|	БюджетФактОбороты_Доп.СтатьяБюджета,
	|	БюджетФактОбороты_Доп.Статус,
	|	БюджетФактОбороты_Доп.Регистратор,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ВЫБОР
	|		КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|			ТОГДА ЕСТЬNULL(БюджетФактОбороты_Доп.КоличествоОборот, 0) / 1000000
	|		ИНАЧЕ ВЫБОР
	|				КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|					ТОГДА ЕСТЬNULL(БюджетФактОбороты_Доп.КоличествоОборот, 0) / 1000
	|				ИНАЧЕ ЕСТЬNULL(БюджетФактОбороты_Доп.КоличествоОборот, 0)
	|			КОНЕЦ
	|	КОНЕЦ,
	|	БюджетФактОбороты_Доп.ПризнакКоличествоОборот,
	|	0
	|ИЗ
	|	РегистрНакопления.б_БюджетФакт.Обороты(&НачалоТриГодаНазад, &КонецТриГодаНазад, Регистратор, Бюджет = &ФормируемыйБюджет) КАК БюджетФактОбороты_Доп
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	б_БюджетОбороты.Организация,
	|	б_БюджетОбороты.СтатьяБюджета,
	|	б_БюджетОбороты.Статус,
	|	б_БюджетОбороты.Регистратор,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ВЫБОР
	|		КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|			ТОГДА ЕСТЬNULL(б_БюджетОбороты.КоличествоОборот, 0) / 1000000
	|		ИНАЧЕ ВЫБОР
	|				КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|					ТОГДА ЕСТЬNULL(б_БюджетОбороты.КоличествоОборот, 0) / 1000
	|				ИНАЧЕ ЕСТЬNULL(б_БюджетОбороты.КоличествоОборот, 0)
	|			КОНЕЦ
	|	КОНЕЦ
	|ИЗ
	|	РегистрНакопления.б_Бюджет.Обороты(&НачалоПредыдущегопериода, &КонецПредыдущегоПериода, Регистратор, Бюджет = &ФормируемыйБюджет) КАК б_БюджетОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.Организация,
	|	ВТ.СтатьяБюджета,
	|	ВТ.Статус,
	|	ВТ.ДокументДвижения,
	|	ВЫРАЗИТЬ(ВТ.КоличествоЯнварь КАК ЧИСЛО(15, 2)) КАК КоличествоЯнварь,
	|	ВЫРАЗИТЬ(ВТ.КоличествоФевраль КАК ЧИСЛО(15, 2)) КАК КоличествоФевраль,
	|	ВЫРАЗИТЬ(ВТ.КоличествоМарт КАК ЧИСЛО(15, 2)) КАК КоличествоМарт,
	|	ВЫРАЗИТЬ(ВТ.КоличествоАпрель КАК ЧИСЛО(15, 2)) КАК КоличествоАпрель,
	|	ВЫРАЗИТЬ(ВТ.КоличествоМай КАК ЧИСЛО(15, 2)) КАК КоличествоМай,
	|	ВЫРАЗИТЬ(ВТ.КоличествоИюнь КАК ЧИСЛО(15, 2)) КАК КоличествоИюнь,
	|	ВЫРАЗИТЬ(ВТ.КоличествоИюль КАК ЧИСЛО(15, 2)) КАК КоличествоИюль,
	|	ВЫРАЗИТЬ(ВТ.КоличествоАвгуст КАК ЧИСЛО(15, 2)) КАК КоличествоАвгуст,
	|	ВЫРАЗИТЬ(ВТ.КоличествоСентябрь КАК ЧИСЛО(15, 2)) КАК КоличествоСентябрь,
	|	ВЫРАЗИТЬ(ВТ.КоличествоОктябрь КАК ЧИСЛО(15, 2)) КАК КоличествоОктябрь,
	|	ВЫРАЗИТЬ(ВТ.КоличествоНоябрь КАК ЧИСЛО(15, 2)) КАК КоличествоНоябрь,
	|	ВЫРАЗИТЬ(ВТ.КоличествоДекабрь КАК ЧИСЛО(15, 2)) КАК КоличествоДекабрь,
	|	ВЫРАЗИТЬ(ВТ.КоличествоПервыйКвартал КАК ЧИСЛО(15, 2)) КАК КоличествоПервыйКвартал,
	|	ВЫРАЗИТЬ(ВТ.КоличествоВторойКвартал КАК ЧИСЛО(15, 2)) КАК КоличествоВторойКвартал,
	|	ВЫРАЗИТЬ(ВТ.КоличествоТретийКвартал КАК ЧИСЛО(15, 2)) КАК КоличествоТретийКвартал,
	|	ВЫРАЗИТЬ(ВТ.КоличествоЧетвертыйКвартал КАК ЧИСЛО(15, 2)) КАК КоличествоЧетвертыйКвартал,
	|	ВЫРАЗИТЬ(ВТ.КоличествоЗаПолугодие КАК ЧИСЛО(15, 2)) КАК КоличествоЗаПолугодие,
	|	ВЫРАЗИТЬ(ВТ.КоличествоЗаДевятьМесяцев КАК ЧИСЛО(15, 2)) КАК КоличествоЗаДевятьМесяцев,
	|	ВЫРАЗИТЬ(ВТ.КоличествоИтого КАК ЧИСЛО(15, 2)) КАК КоличествоИтого,
	|	ВЫРАЗИТЬ(ВТ.КоличествоИтогоФакт КАК ЧИСЛО(15, 2)) КАК КоличествоИтогоФакт,
	|	ВЫРАЗИТЬ(ВТ.КоличествоПредыдущий КАК ЧИСЛО(15, 2)) КАК КоличествоПредыдущий,
	|	ВЫРАЗИТЬ(ВТ.КоличествоПредществующий КАК ЧИСЛО(15, 2)) КАК КоличествоПредществующий,
	|	ВЫРАЗИТЬ(ВТ.КоличествоТриГодаНазад КАК ЧИСЛО(15, 2)) КАК КоличествоТриГодаНазад,
	|	ВТ.ПризнакКоличество,
	|	ВЫРАЗИТЬ(ВТ.КоличествоПланПредыдущий КАК ЧИСЛО(15, 2)) КАК КоличествоПланПредыдущий,
	|	""тыс. тонн"" КАК ЕдИзмерения,
	|	ВТ.СтатьяБюджета.КодСтрокиБюджета КАК КодСтроки
	|ИЗ
	|	ВТ КАК ВТ";

	Запрос.УстановитьПараметр("ЕдиницаИзмерения",ЕдиницаИзмерения);
	Запрос.УстановитьПараметр("ФормируемыйБюджет",ФормируемыйБюджет);
	Запрос.УстановитьПараметр("НачалоПериода",НачалоДня(НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода",КонецДня(КонецПериода));
	Запрос.УстановитьПараметр("НачалоПредыдущегопериода", НачалоДня(Дата(Год(НачалоПериода)-1,1,1)));
	Запрос.УстановитьПараметр("КонецПредыдущегоПериода",КонецДня(Дата(Год(НачалоПериода)-1,12,31)));
	Запрос.УстановитьПараметр("НачалоПредществующегоПериода",НачалоДня(Дата(Год(НачалоПериода)-2,1,1)));
	Запрос.УстановитьПараметр("КонецПредществующегоПериода", КонецДня(Дата(Год(НачалоПериода)-2,12,31)));
	Запрос.УстановитьПараметр("НачалоТриГодаНазад",НачалоДня(Дата(Год(НачалоПериода)-3,1,1)));
	Запрос.УстановитьПараметр("КонецТриГодаНазад", КонецДня(Дата(Год(НачалоПериода)-3,12,31)));
	
	Возврат Запрос.Выполнить();


КонецФункции

Процедура ОбработкаРезультатаОтчета(Результат)
	
	ТиповыеОтчеты.ОбработкаРезультатаОтчета(ЭтотОбъект, Результат);

КонецПроцедуры

// Для настройки отчета (расшифровка и др.)
Процедура Настроить(Отбор, КомпоновщикНастроекОсновногоОтчета = Неопределено) Экспорт
	
	//ТиповыеОтчеты.НастроитьТиповойОтчет(ЭтотОбъект, Отбор, КомпоновщикНастроекОсновногоОтчета);
	ЗаполнитьНачальныеНастройки();
	
КонецПроцедуры

Процедура СохранитьНастройку() Экспорт
	
	СтруктураНастроек = ТиповыеОтчеты.ПолучитьСтруктуруПараметровТиповогоОтчета(ЭтотОбъект);
	
	СтруктураНастроек.Вставить("мСписокПодразделений", мСписокПодразделений);
	СтруктураНастроек.Вставить("мСписокСтруктурныхЕдиниц", мСписокСтруктурныхЕдиниц);
	СтруктураНастроек.Вставить("мДеревоСтруктурныхЕдиниц", мДеревоСтруктурныхЕдиниц);
	
	СохранениеНастроек.СохранитьНастройкуОбъекта(СохраненнаяНастройка, СтруктураНастроек);

КонецПроцедуры

// Процедура заполняет параметры отчета по элементу справочника из переменной СохраненнаяНастройка.
Процедура ПрименитьНастройку() Экспорт
	
	Если СохраненнаяНастройка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	 
	СтруктураПараметров = СохраненнаяНастройка.ХранилищеНастроек.Получить();
	ТиповыеОтчеты.ПрименитьСтруктуруПараметровОтчета(ЭтотОбъект, СтруктураПараметров);
	
КонецПроцедуры


Расшифровки = Новый СписокЗначений;

НастройкаПериода = Новый НастройкаПериода;

#КонецЕсли
мСписокИсточниковФинансирования = Новый СписокЗначений;
мСписокСтруктурныхЕдиниц = Новый СписокЗначений;
мСписокПодразделений = Новый СписокЗначений;
мДеревоСтруктурныхЕдиниц = Новый ДеревоЗначений;

ВедётсяУчетПоПодразделениям = ОбщегоНазначения.ПолучитьПризнакОтображенияСтруктурныхПодразделений();

РежимРасшифровки = Ложь;
